Repository: cvc-digital/typo3-webauthn
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# login.link
source: Login with a WebAuthn Authenticator
de: Login mit einem WebAuthn-Authentifikator

# login.next
source: Next
de: Weiter

# labels_table_headline
source: Your registered WebAuthn Authenticators:
de: Ihre registrierten WebAuthn-Authentifikator:

# labels_table_keydescr
source: WebAuthn Authenticator description
de: WebAuthn-Authentifikator-Bezeichnung

# labels_table_date
source: Creation date
de: Erstelldatum

# labels_table_actions
source: Actions
de: Aktionen

# labels_register_key
source: Register WebAuthn Authenticator
de: WebAuthn-Authentifikator registrieren

# labels_key_descr
source: WebAuthn Authenticator description
de: WebAuthn-Authentifikator-Beschreibung

# button_login_loading
source: WebAuthn Authenticator is being registered...
de: WebAuthn-Authentifikator wird registriert...

# labels_extension_descr
source: Checks whether the WebAuthn Authenticator is valid
de: Überprüft ob der WebAuthn-Authentifikator gültig ist

# labels_extension_title
source: Use a WebAuthn Authenticator
de: Einen WebAuthn-Authentifikator verwenden

# labels_key_content
source: WebAuthn Authenticator content
de: WebAuthn-Authentifikator-Inhalt

# template_headline_webauthn
source: WebAuthn Authenticators
de: WebAuthn-Authentifikator

# security_key_registered_success
source: WebAuthn Authenticator successfuly registered
de: WebAuthn-Authentifikator wurde erfolgreich registriert

# security_key_success_delete
source: WebAuthn Authenticator successfuly deleted
de: WebAuthn-Authentifikator erfolgreich gelöscht

# js_error_key_registered
source: WebAuthn Authenticator is already registered
de: WebAuthn-Authentifikator ist schon vorhanden

# js_error_unspecified
source: An unspecified error occurred
de: Ein nicht bekannter Fehler ist aufgetreten

# js_confirm_question
source: Are you sure?
de: Sind Sie sich sicher?

# js_confirm_dialog
source: Are you sure you want to delete this record?
de: Sind Sie sich sicher ob sie diesen Eintrag löschen möchten?
